Repository: robot-xliff-farmer/bem-method
Catalog: bem-method.tmx
Source language: ru
Languages: en

source: Почему в методологии БЭМ не существует элементов элементов?
en: Why does the BEM methodology not recommend using elements within elements?

source: БЭМ-сущность, определяющая внешний вид, состояние и поведение блока или элемента.
en: A BEM entity that defines the appearance and behavior of a block or an element.

source: Использование модификаторов опционально.
en: The use of modifiers is optional.

source: По своей сути модификаторы похожи на атрибуты в HTML. Один и тот же блок выглядит по-разному благодаря применению модификатора.
en: Modifiers are similar in essence to HTML attributes. The same block looks different due to the use of a modifier.

source: Например, внешний вид блока меню (menu) может меняться в зависимости от примененного модификатора.
en: For instance, the appearance of the menu block (menu) may change depending on a modifier that is used on it.

source: Добавить меню в подвале
en: Add a menu to the footer

source: БЭМ-сущностями называются блоки, элементы и модификаторы.
en: Blocks, elements, and modifiers are all called BEM entities.

source: Это понятие может применяться как частное, если рассматривается отдельная БЭМ-сущность, и как собирательное для блоков, элементов и модификаторов.
en: It is a notion that can be used both to refer to an individual BEM entity and as a generic term for blocks, elements, and modifiers.

source: Способ использования разных БЭМ-сущностей на одном DOM-узле.
en: An instance of different BEM entities being hosted on a single DOM node.

source: Миксы позволяют:
en: Mixes allow us to

source: совмещать поведение и стили нескольких БЭМ-сущностей без дублирования кода;
en: Combine the behaviors and styles of several BEM entities while avoiding code duplication

source: создавать семантически новые компоненты интерфейса на основе имеющихся БЭМ-сущностей.
en: Create semantically new interface components on the basis of existing BEM entities.

source: Рассмотрим пример микса блока и элемента другого блока.
en: Let's consider the case of a mix comprising a block and an element of another block.

source: Допустим, в проекте ссылки реализованы блоком link. Необходимо сделать ссылками пункты меню. Существует несколько способов:
en: Let's assume that links in your project are implemented via a link block. We need to format menu items as links. There are several ways to do that.

source: Создать модификатор для пункта меню, который превратит пункт в ссылку. Но в таком случае для реализации модификатора придется скопировать поведение и стили блока link. Это приведет к дублированию кода.
en: Create a modifier for a menu item that turns the item into a link. Implementing such a modifier would necessarily involve copying the behavior and styles of the link block. That would result in code duplication.

source: Воспользоваться миксом универсального блока link и элемента link блока menu. Микс двух БЭМ-сущностей позволит применить базовую функциональность ссылок из блока link и дополнительные CSS-правила из блока menu без копирования кода.
en: Have a mix combining a generic link block and a link element of a menu block. A mix of the two BEM entities will allow us to use the basic link functionality of the link block and additional CSS rules of the menu block without copying the code.

source: https://ru.wikipedia.org/wiki/Document_Object_Model
en: https://en.wikipedia.org/wiki/Document_Object_Model

source: Представление структуры веб-страницы в терминах блоков, элементов и модификаторов. Это абстракция над DOM-деревом, которая описывает имена БЭМ-сущностей, их состояния, порядок, вложенность и вспомогательные данные.
en: A representation of a web page structure in terms of blocks, elements, and modifiers. It is an abstraction over a DOM tree that describes the names of BEM entities, their states, order, nesting, and auxiliary data.

source: В реальных проектах БЭМ-дерево можно выразить любым форматом, который поддерживает древовидную структуру.
en: In real-life projects, a BEM tree can be presented in any format that supports the tree structure.

source: Рассмотрим пример DOM-дерева:
en: Let's consider an example of a DOM tree:

source: Ему соответствует такое БЭМ-дерево:
en: The corresponding BEM tree will look like this:

source: https://ru.bem.info/technology/bemjson/
en: https://en.bem.info/technology/bemjson/

source: Это же БЭМ-дерево будет иметь следующий вид в форматах XML и BEMJSON:
en: In XML and BEMJSON formats, the same BEM tree will appear as follows:

source: Набор различных технологий, определяющих следующие особенности БЭМ-сущности:
en: A set of different technologies that determine the following aspects of a BEM entity:

source: поведение;
en: behavior

source: внешний вид;
en: appearance

source: тесты;
en: tests

source: шаблоны;
en: templates

source: документацию;
en: documentation

source: описание зависимостей;
en: description of dependencies

source: дополнительные данные (например, картинки).
en: additional data (e.g., images).

source: Технология реализации
en: Implementation technology

source: Технология, которая используется для реализации блока.
en: A technology used for implementing a block.

source: Блоки могут быть реализованы в одной или нескольких технологиях, например:
en: Blocks can be implemented in one or more technologies, for example:

source: поведение — JavaScript, CoffeeScript;
en: behavior — JavaScript, CoffeeScript

source: шаблоны — BEMHTML, BH, Jade, Handlebars, XSL;
en: templates — BEMHTML, BH, Jade, Handlebars, XSL

source: документация — Markdown, Wiki, XML.
en: documentation — Markdown, Wiki, XML.

source: Например, если внешний вид блока задан с помощью CSS, это означает, что блок реализован в технологии CSS. А если документация к блоку написана в формате MarkDown — блок реализован в технологии MarkDown.
en: For instance, if the appearance of a block is defined with CSS, that means that the block is implemented in the CSS technology. Likewise, if the documentation for a block is written in Markdown format, the block is implemented in the Markdown technology.

source: Изменение реализации блока путем добавления ему новых особенностей на другом уровне.
en: Modifying a block implementation by adding new features to the block on a different level.

source: Набор БЭМ-сущностей и их частичных реализаций.
en: A set of BEM entities and their partial implementations.

source: Конечная реализация блока может быть разделена по разным уровням переопределения. Каждый последующий уровень добавляет или перекрывает исходную реализацию блока. Конечный результат собирается из отдельных технологий реализации блока со всех уровней переопределения последовательно в заданном порядке.
en: The final implementation of a block can be divided into different redefinition levels. Each new level extends or overrides the original implementation of the block. The end result is assembled from individual implementation technologies of the block from all redefinition levels in a pre-determined consecutive order.

source: Переопределять можно любые технологии реализации БЭМ-сущностей.
en: Any implementation technologies of BEM entities can be redefined.

source: Например, в проект на отдельный уровень подключается сторонняя библиотека, которая содержит готовые реализации блоков. Проектные блоки хранятся на другом уровне переопределения.
en: For example, there is a third-party library linked to a project on a separate level. The library contains ready-made block implementations. The project-specific blocks are stored on a different redefinition level.

source: Предположим, что необходимо изменить внешний вид одного из блоков библиотеки. Для этого не нужно менять CSS-правила блока в исходном коде библиотеки или копировать код на уровень проекта. Достаточно создать дополнительные CSS-правила для этого блока на проектном уровне. При сборке в конечную реализацию подключится исходная функциональность с уровня библиотеки и новые стили с уровня проекта.
en: Let's say we need to modify the appearance of one of the library blocks. That doesn't require changing the CSS rules of the block in the library source code or copying the code at the project level. We only need to create additional CSS rules for that block at the project level. During the build process, the resulting implementation will incorporate both the original rules from the library level and the new styles from the project level.

source: Соглашение по именованию
en: Naming convention

source: Для работы с БЭМ-сущностями необходимо ознакомиться с правилами их именования.
en: Working with BEM entities requires a knowledge of their naming rules.

source: Основная идея соглашения по именованию — сделать имена CSS-селекторов максимально информативными и понятными. Это поможет упростить разработку и отладку кода, а также решить некоторые проблемы веб-разработчиков.
en: The main idea of the naming convention is to make names of CSS selectors as informative and clear as possible. This will help make code development and debugging easier and also solve some of the problems faced by web developers.

source: В качестве примера рассмотрим CSS-селектор menuitemvisible. Быстрый просмотр такой записи не дает возможности определить типы БЭМ-сущностей по имени.
en: Let's say we have a CSS selector named menuitemvisible. A quick view of such a notation doesn't allow us to identify types of BEM entities from the name of the selector.

source: Добавим разделитель:
en: Let’s add a delimiter:

source: menu-item-visible или menuItemVisible
en: menu-item-visible or menuItemVisible

source: В таком виде имя селектора явно разделяется на логические части. Можем предположить, что menu окажется блоком, item — элементом, а visible — модификатором. Однако в реальной жизни часто возникают более сложные и не столь однозначные случаи, решить которые помогает соглашение по именованию БЭМ.
en: Written like this, the name of the selector is clearly divided into logical parts. We can assume menu to be a block, item to be an element, and visible to be a modifier. However, real-life examples are often more complicated and not as straightforward, and that’s where the BEM naming convention comes in useful.

source: БЭМ-методология предоставляет идею по созданию правил формирования имен и свой способ ее реализации — соглашение по именованию CSS-селекторов. Однако в мире веб-разработки существует ряд альтернативных схем, основанных на принципах БЭМ.
en: The BEM methodology provides an idea for creating naming rules and implements that idea in its canonical CSS selector naming convention. However, a number of alternative schemes based on the BEM principles also exist in the world of web development.

source: Соглашение по именованию CSS-селекторов
en: CSS selector naming convention

source: Имена БЭМ-сущностей записываются с помощью цифр и латинских букв в нижнем регистре.
en: Names of BEM entities are written using numbers and lowercase Latin characters.

source: Для разделения слов в именах используется дефис (-).
en: Individual words within names are separated by a hyphen (-).

source: Для хранения информации об именах блоков, элементов и модификаторов используются CSS-классы.
en: Information about the names of blocks, elements, and modifiers is stored using CSS classes.

source: Правила формирования имен:
en: Naming rules for:

source: блоков
en: blocks

source: элементов
en: elements

source: модификаторов
en: modifiers

source: Имя блока
en: Block name

source: https://ru.wikipedia.org/wiki/Пространство_имён
en: https://en.wikipedia.org/wiki/Namespace

source: Имя блока формируется по схеме block-name и задает пространство имен для элементов и модификаторов.
en: A block name follows the block-name scheme and defines a namespace for elements and modifiers.

source: https://ru.bem.info/method/history/#Появление-блоков
en: https://en.bem.info/method/history/#blocks-to-the-rescue

source: Иногда к именам блоков могут добавляться различные префиксы. Подробнее о нашем опыте использования префиксов рассказывается в статье История создания БЭМ.
en: Different prefixes can sometimes be added to block names. Our experience of using prefixes is told in detail in the article The History of BEM.

source: Имя элемента
en: Element name

source: Пространство имен, заданное именем блока, определяет принадлежность элемента к данному блоку. Имя элемента отделяется от имени блока двумя подчеркиваниями (__).
en: The namespace defined by the name of a block identifies an element as belonging to the block. An element name is delimited by a double underscore (__).

source: Полное имя элемента создается по схеме:
en: The full name of an element is created using this scheme:

source: Если блок имеет несколько одинаковых элементов, как в случае пунктов меню, то все они будут иметь одинаковые имена menu__item.
en: If a block has several identical elements, such as in the case of menu items, all of them will have the same name menu_item.

source: Важно! В методологии БЭМ не существует элементов элементов. _________________________________________
en: Important! Using elements within elements is not recommended by the BEM methodology. _________________________________________

source: Имя модификатора
en: Modifier name

source: Пространство имен, заданное именем блока, определяет принадлежность модификатора к данному блоку или его элементу. Имя модификатора отделяется от имени блока или элемента одним подчеркиванием (_).
en: The namespace defined by the name of a block identifies a modifier as belonging to that block or its element. A modifier name is delimited by a single underscore (_).

source: Полное имя модификатора создается по схеме:
en: The full name of a modifier is created using the scheme:

source: Для булевых модификаторов — owner-name_mod-name.
en: For Boolean modifiers — owner-name_mod-name.

source: Для модификаторов вида «ключ-значение» — owner-name_mod-name_mod-val.
en: For key-value type modifiers — owner-name_mod-name_mod-val.

source: Важно! В методологии БЭМ модификатор не может использоваться в отрыве от своего владельца. _________________________________________________
en: Important! In the BEM methodology, a modifier cannot be used outside of the context of its owner. _________________________________________________

source: Модификатор блока
en: Block modifier

source: Булевый модификатор. Значение такого модификатора не указывается. Полное имя создается по схеме: block-name_mod-name.
en: Boolean modifier. The value of such a modifier is not specified. The full name is created using the scheme: block-name_mod-name.

source: Модификатор типа «ключ — значение». Значение модификатора отделяется от имени одним подчеркиванием (_). Полное имя создается по схеме: block-name_mod-name_mod-val.
en: Key-value type modifier. The value of a modifier is separated from its name by a single underscore (_). The full name is created using the scheme: block-name_mod-name_mod-val.

source: Неверная форма записи
en: Incorrect notation

source: В данном случае в записи отсутствует сам блок, на который влияет модификатор.
en: Here the notation is missing the block that is affected by the modifier.

source: Модификатор элемента
en: Element modifier

source: Булевый модификатор. Значение такого модификатора не указывается. Полное имя создается по схеме: block-name__elem-name_mod-name.
en: Boolean modifier. The value of such a modifier is not specified. The full name is created using this scheme: block-name__elem-name_mod-name.

source: Модификатор типа «ключ — значение». Значение модификатора отделяется от имени одним подчеркиванием (_). Полное имя создается по схеме: block-name__elem-name_mod-name_mod-val.
en: Key-value type modifier. The value of a modifier is separated from its name by a single underscore (_). The full name is created using the scheme: block-name__elem-name_mod-name_mod-val.

source: Пример
en: Example

source: Пример использования соглашения по именованию
en: Example of using the naming convention

source: Реализация формы аутентификации в HTML и CSS:
en: The implementation of an authorization form in HTML and CSS:

source: Альтернативные схемы именования
en: Alternative naming schemes

source: Существуют альтернативные решения, основанные на соглашении по именованию БЭМ.
en: There are some alternative solutions that are based on the BEM naming convention.

source: Стиль Гарри Робертса
en: Harry Roberts' style

source: Одним из первых, кто заговорил о БЭМ в англоязычном мире, был Гарри Робертс. В своей статье MindBEMding – getting your head ’round BEM syntax он рассказал о соглашении по именованию CSS-классов по БЭМ-методологии. Гарри Робертс предложил свою схему именования, основанную на принципах БЭМ:
en: One of the first to mention BEM in the English-speaking world was Harry Roberts. In his article MindBEMding – getting your head ’round BEM syntax, he spoke about the convention for naming CSS classes according to the BEM methodology. Harry Roberts proposed his own naming scheme based on the BEM principles.

source: Имена записываются в нижнем регистре.
en: Names are written in lower case.

source: Для разделения слов в именах БЭМ-сущностей используется дефис (-).
en: Words within the names of BEM entities are separated by a hyphen (-).

source: Имя элемента отделяется от имени блока с помощью двух подчеркиваний (__).
en: An element name is separated from a block name by a double underscore (__).

source: Булевые модификаторы отделяются с помощью двух дефисов (--).
en: Boolean modifiers are delimited by double hyphens (--).

source: Модификаторы вида «ключ-значение» не используются.
en: Key-value type modifiers are not used.

source: Стиль CamelCase
en: CamelCase style

source: https://ru.wikipedia.org/wiki/CamelCase
en: https://en.wikipedia.org/wiki/CamelCase

source: Данный стиль отличается от классического использованием CamelCase вместо дефиса для разделения слов в именах БЭМ-сущностей.
en: This style differs from the classic one in that it uses CamelCase instead of a hyphen for separating words within BEM entity names.

source: Стиль без подчеркиваний
en: 'Sans underscore' style

source: Для записи имен используется CamelCase.
en: Names are written in CamelCase.

source: Имя элемента отделяется от имени блока с помощью одного дефиса (-).
en: An element name is separated from a block name by a single hyphen (-).

source: Для отделения модификатора используется два дефиса (--).
en: Modifiers are delimited by double hyphens (--).

source: Значение модификатора отделяется от его имени с помощью двух дефисов (--).
en: The value of a modifier is separated from its name by a double hyphen (--).

source: Стиль No-namespace
en: No_namespace style

source: Основное отличие данного стиля в отсутствии имени блока перед модификатором. Такая схема накладывает ограничения на использование миксов, так как не дает возможности определить, к какому блоку относится модификатор.
en: This style is characterized by the absence of a block name before a modifier. Such a scheme puts limitations on the use of mixes, as it makes it impossible to determine what block a modifier belongs to.

source: Какой стиль выбрать
en: Which style to choose

source: Методология БЭМ предлагает общие принципы именования БЭМ-сущностей. Выбор схемы именования зависит от требований вашего проекта и личных предпочтений. Использование предложенного методологией соглашения по именованию имеет один существенный плюс — наличие готовых инструментов для разработки, которые ориентируются именно на «классическое именование».
en: The BEM methodology offers general principles for naming BEM entities. The choice of a particular naming scheme depends on your project requirements and personal preferences. One considerable advantage of using the naming convention offered by the methodology is the existence of ready-made development tools that are specifically geared towards the ”classic naming“.

source: https://ru.bem.info/tools/bem/bem-naming
en: https://en.bem.info/tools/bem/bem-naming/

source: Помимо этого, БЭМ-методология не ограничивается использованием технологий HTML и CSS, рассмотренных в этом документе. Понятия блоков, элементов и модификаторов применяются при работе с JavaScript, шаблонами и файловой системой БЭМ-проекта. Инструмент bem-naming позволяет применять одинаковые имена БЭМ-сущностей во всех используемых технологиях реализации.
en: Besides, the BEM methodology in not limited in its scope to the HTML and CSS technologies, which are discussed in this document. The concepts of blocks, elements, and modifiers are used when working with the JavaScript, templates and file system of a BEM project. The bem-naming tool enables us to use the same names for BEM entities in all of the implementation technologies that may be used.

source: По умолчанию bem-naming содержит настройки соглашения по именованию, предложенного методологией, но позволяет добавлять правила для использования альтернативных схем.
en: By default, bem-naming is configured to use the naming convention according to the methodology, but it allows you to add rules so you can use alternative schemes.

source: Часто задаваемые вопросы
en: Frequently asked questions

source: Почему БЭМ?
en: Why BEM?

source: В чем отличие БЭМ от OOCSS, AMCSS, SMACSS, SUITCSS?
en: How does BEM differ from OOCSS, AMCSS, SMACSS, SUITCSS?

source: В чем разница между БЭМ и Web Components?
en: What is the difference between BEM and Web Components?

source: В чем разница между БЭМ и Bootstrap?
en: What is the difference between BEM and Bootstrap?

source: Блоки и элементы
en: Blocks and elements

source: В каком случае создавать блок, в каком — элемент?
en: A block or an element: when should I use which?

source: Почему в БЭМ не рекомендуется создавать элементы элементов (block__elem1__elem2)?
en: Why does BEM not recommend using elements within elements (block_elem1_elem2)?

source: Зачем писать имя блока в именах модификаторов и элементов?
en: Why include the block name in modifier names and element names?

source: Как сделать глобальные модификаторы для блоков?
en: How do I make global modifiers for blocks?

source: Зачем создавать отдельные директории и файлы для каждого блока и технологии?
en: Why create separate directories and files for every block and technology?

source: Зачем использовать i-bem.js, если можно писать на jQuery?
en: Why use i-bem.js when you have jQuery?

source: Почему нежелательно использовать вложенные селекторы?
en: Why should I avoid using nested selectors?

source: Почему в БЭМ не рекомендуется использовать комбинированные селекторы для создания CSS-правил к модификатору?
en: Why does BEM advise against using combined selectors for creating CSS rules for modifiers?

source: Можно ли объединять тег и класс в селекторе (например, button.button)?
en: Can I combine a tag and a class in a selector (e.g. button.button)?

source: Почему в БЭМ не используют пользовательские теги (custom tag) для блоков?
en: Why are custom tags not used for blocks in BEM?

source: Почему нельзя делать общий сброс стилей (reset)?
en: Why can't I use a CSS Reset?

source: Почему нельзя писать <div class="block_mod"> вместо <div class="block block_mod">, если имя модификатора уже содержит всю информацию о блоке?
en: Why can't I write <div class="block_mod"> instead of <div class="block block_mod">, when the modifier name already contains all the block data?

source: Почему нельзя указывать название CSS-свойства в имени модификатора: .block__element_border-color_grey?
en: Why can't I include a CSS property name in a modifier name: .block__element_border-color_grey?

source: https://ru.bem.info/forum/
en: https://en.bem.info/forum/

source: Не нашли ответ? — Задайте вопрос команде на форуме
en: Not found your question? — Ask our team on the forum

source: БЭМ работает не только с CSS, но и с JavaScript.
en: BEM is applicable to JavaScript as well as CSS.
